data_analysis/repo/gpu_log/benchmark_20250629_112411_mDeepSeek-R1-Distill-Llama-70B_np200_mc40_in512_out512.log
INFO 06-29 11:24:15 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=40, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=512', 'output_len=512', 'serving=vllm'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 40
100%|██████████| 200/200 [00:39<00:00,  5.11it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  39.15     
Total input tokens:                      102200    
Total generated tokens:                  93087     
Request throughput (req/s):              5.11      
Output token throughput (tok/s):         2377.59   
Total Token throughput (tok/s):          4987.94   
---------------Time to First Token----------------
Mean TTFT (ms):                          80.61     
Median TTFT (ms):                        58.54     
P99 TTFT (ms):                           174.58    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.22     
Median TPOT (ms):                        15.30     
P99 TPOT (ms):                           15.49     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.27     
Median ITL (ms):                         15.20     
P99 ITL (ms):                            26.21     
==================================================